# Доработаем предыдущую задачу.
# ✔ Создайте новую функцию которая генерирует файлы с разными расширениями.
# ✔ Расширения и количество файлов функция принимает в качестве параметров.
# ✔ Количество переданных расширений может быть любым.
# ✔ Количество файлов для каждого расширения различно.
# ✔ Внутри используйте вызов функции из прошлой задачи.
from create_rnd_file import my_func


def func5(**kwargs):
    for key, value in kwargs.items():
        my_func(expantion=key,quantity=value)


# func5(txt=1, md=2)
